УНФ_ТЕСТ/src/Catalogs/КП_ВидыПроцессов/КП_ВидыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ВидыПроцессов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДействиеПараллельное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеРеквизитыРасполагатьВДваСтолбца</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеТекстаПроцессаПослеСтартаРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОсновныхИсполнителей</name>
    <comment>0 - список исполнителей, 1 - рабочая группа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КопироватьОставлятьИсполнителейЗаданныхВНастройкеВида</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КопироватьПолучателейИзДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КопироватьСотрудниковИзДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппаОсновныхИсполнителей</name>
    <type>
      <types>CatalogRef.КП_РабочиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйВидПроцесса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартыПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписанияПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныДокументовДляНовыхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеСхемыПроцессаПослеСтартаРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШаблонаНаименований</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеКонтролераПроцессаПослеСтартаРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СетьМаршрутныхТочек</name>
    <attributes>
      <name>ТочкаВыход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаВход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловныйПереход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПерехода</name>
      <comment>для точки Условия - 0 (нет), 1 (да); для точки ВыборВарианта - номер варианта</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛинииНаСхеме</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПереходаНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеИсполнители</name>
    <attributes>
      <name>ТочкаАдресации</name>
      <type>
        <types>CatalogRef.КП_РолеваяАдресация</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетИсполнителя</name>
      <type>
        <types>CatalogRef.КП_ТребуемыеРезультатыИсполнителей</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияТекст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйТекстЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальноеНаименованиеЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНаправленияПараллельное</name>
      <comment>1 - параллельное, 0 - последовательное</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьГрафикРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИднИсполнителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаименованияЭлементовПроцесса</name>
    <attributes>
      <name>ЭлементФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлементаИностранное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаименованияЭлементовЗадач</name>
    <attributes>
      <name>ЭлементФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЭлементаИностранное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыПроцессов</name>
    <comment>Реквизиты процессов</comment>
    <attributes>
      <name>РеквизитПроцесса</name>
      <type>
        <types>CatalogRef.КП_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыБизнесПроцесса</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Enums/КП_ВидыТочекБизнесПроцесса/КП_ВидыТочекБизнесПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КП_ВидыТочекБизнесПроцесса</name>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
  <enumValues>
    <name>Действие</name>
  </enumValues>
  <enumValues>
    <name>Условие</name>
  </enumValues>
  <enumValues>
    <name>Подпроцесс</name>
  </enumValues>
  <enumValues>
    <name>Разделение</name>
  </enumValues>
  <enumValues>
    <name>Слияние</name>
  </enumValues>
  <enumValues>
    <name>Декорация</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>ВыборВарианта</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_ВидыПроцессов/Forms/ФормаПодготовкиКОтладкеИТестированию/Module.bsl
&НаКлиенте
Процедура УстановитьЕдинственногоИсполнителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(ВидПроцесса) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en='Please specify the type of process.';ru='Сначала укажите вид процесса.'"), 60, КП_ОбщееКлиент.ЗаголовокДиалога());				
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en='Please specify the user.';ru='Сначала укажите исполнителя.'"), 60, КП_ОбщееКлиент.ЗаголовокДиалога());				
		Возврат;
		
	КонецЕсли;

	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьЕдинственногоИсполнителяЗавершение", ЭтотОбъект), НСтр("en='In the form of the ""';ru='Внимание! В виде процесса ""'")+СокрЛП(ВидПроцесса)+""" "+Символы.ПС+НСтр("en='all users will be replaced by a single ""';ru='все исполнители будут заменены на единственного ""'")+СокрЛП(Исполнитель)+НСтр("ru='""! Продолжить?'; en='Do you want to continue?';"), РежимДиалогаВопрос.ДаНет,,,КП_ОбщееКлиент.ЗаголовокДиалога());	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЕдинственногоИсполнителяЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    УстановитьИсполнителяСервером();

КонецПроцедуры

&НаСервере
Процедура УстановитьИсполнителяСервером()
	
	ИднИсполнителя=КП_ОбщееСервер.СформироватьИднИсполнителя(Исполнитель);
	
	//изменим основной процесс
	ВидОбъект=ВидПроцесса.ПолучитьОбъект();
	Если СокрЛП(ВидОбъект.Контролер)<>"" Тогда
		//если или было какое то значение
		ВидОбъект.Контролер=Исполнитель;
	КонецЕсли;
	
	ВидОбъект.ИсточникОсновныхИсполнителей=0; //список основных исполнителей
	Если ВидОбъект.ОсновныеИсполнители.Количество()>0 Тогда
		Для Каждого СтрокаТЧ Из ВидОбъект.ОсновныеИсполнители Цикл
			СтрокаТЧ.ТочкаАдресации=Исполнитель;
			СтрокаТЧ.ИднИсполнителя=ИднИсполнителя;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		ВидОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	//изменим точки процесса
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КП_ТочкиПроцессов.Ссылка
	                    |ИЗ
	                    |	Справочник.КП_ТочкиПроцессов КАК КП_ТочкиПроцессов
	                    |ГДЕ
	                    |	КП_ТочкиПроцессов.ВладелецТочки = &ВладелецТочки
	                    |	И КП_ТочкиПроцессов.ПометкаУдаления = ЛОЖЬ");
						
	Запрос.УстановитьПараметр("ВладелецТочки", ВидПроцесса);
	
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока Выборка.Следующий() Цикл
		ТочкаКБП=Выборка.Ссылка;
		ТочкаОбъект=ТочкаКБП.ПолучитьОбъект();

		Для Каждого СтрокаТЧ Из ТочкаОбъект.ИсполнителиТочки Цикл
			СтрокаТЧ.ТочкаАдресации=Исполнитель;
			СтрокаТЧ.ИднИсполнителя=ИднИсполнителя;
			
		КонецЦикла;
		
		Попытка
			ТочкаОбъект.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='Recorded point ""';ru='Записана точка ""'")+СокрЛП(ТочкаКБП)+""".");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	//обработаем реквизиты с типом Пользователь
	НаименованиеСправочникаПользователи="Справочник.Пользователи";
	ТипРеквизита=Справочники.КП_СписокМетаданных.НайтиПоРеквизиту("ПолноеНаименование", НаименованиеСправочникаПользователи);
	Если ТипРеквизита.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='The directory list metadata element was not found with the full name ""';ru='Внимание! В справочнике списка метаданных не найден элемент с полным наименованием ""'")+НаименованиеСправочникаПользователи+""".");
		Возврат;
		
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КП_ДополнительныеРеквизиты.Ссылка
	                    |ИЗ
	                    |	Справочник.КП_ДополнительныеРеквизиты КАК КП_ДополнительныеРеквизиты
	                    |ГДЕ
	                    |	КП_ДополнительныеРеквизиты.ЗначениеПоУмолчанию <> &ЗначениеПоУмолчанию
	                    |	И КП_ДополнительныеРеквизиты.ТипРеквизита = &ТипРеквизита
	                    |	И КП_ДополнительныеРеквизиты.ПометкаУдаления = ЛОЖЬ
	                    |	И КП_ДополнительныеРеквизиты.Владелец = &Владелец");
						
	Запрос.УстановитьПараметр("Владелец", ВидПроцесса);
	Запрос.УстановитьПараметр("ЗначениеПоУмолчанию", Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипРеквизита", ТипРеквизита);
	
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		РеквизитОбъект=Выборка.Ссылка.ПолучитьОбъект();
		РеквизитОбъект.ЗначениеПоУмолчанию=Исполнитель;
		
		Попытка
			РеквизитОбъект.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='Logged props ""';ru='Записан реквизит ""'")+СокрЛП(РеквизитОбъект)+""".");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='Update process is complete the form.';ru='Обновление вида процесса завершено.'"));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВидПроцесса", ВидПроцесса);
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтправкуПоЭлПочтеИзТочекОбработки(Команда)
	Если НЕ ЗначениеЗаполнено(ВидПроцесса) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("en='Please specify the type of process.';ru='Сначала укажите вид процесса.'"), 60, КП_ОбщееКлиент.ЗаголовокДиалога());				
		Возврат;
		
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СнятьОтправкуПоЭлПочтеИзТочекОбработкиЗавершение", ЭтотОбъект), НСтр("en='In the process ""';ru='Внимание! В виде процесса ""';")+СокрЛП(ВидПроцесса)+""" "+Символы.ПС+НСтр("en='all sending points will be disabled. Do you want to continue?';ru='во всех точках отправки сообщений будет отключена отправка по эл. почте! Продолжить?'"), РежимДиалогаВопрос.ДаНет,,,КП_ОбщееКлиент.ЗаголовокДиалога());	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтправкуПоЭлПочтеИзТочекОбработкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    СнятьОтправкуПоЭлПочтеСервером();

КонецПроцедуры

&НаСервере
Процедура СнятьОтправкуПоЭлПочтеСервером()
	//изменим точки процесса
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	КП_ТочкиПроцессов.Ссылка
	                    |ИЗ
	                    |	Справочник.КП_ТочкиПроцессов КАК КП_ТочкиПроцессов
	                    |ГДЕ
	                    |	КП_ТочкиПроцессов.ВладелецТочки = &ВладелецТочки
	                    |	И КП_ТочкиПроцессов.ПометкаУдаления = ЛОЖЬ
	                    |	И КП_ТочкиПроцессов.ТипТочки = &ТипТочки
	                    |	И КП_ТочкиПроцессов.ТипОбработки = &ТипОбработки
	                    |	И КП_ТочкиПроцессов.ОтправкаСообщенияПоЭлПочте = ИСТИНА");
						
	Запрос.УстановитьПараметр("ВладелецТочки", ВидПроцесса);
	Запрос.УстановитьПараметр("ТипТочки", Перечисления.КП_ВидыТочекБизнесПроцесса.Обработка);
	Запрос.УстановитьПараметр("ТипОбработки", 6); //отправка по электронной почте
	
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока Выборка.Следующий() Цикл
		ТочкаКБП=Выборка.Ссылка;
		ТочкаОбъект=ТочкаКБП.ПолучитьОбъект();

		ТочкаОбъект.ОтправкаСообщенияПоЭлПочте=Ложь;
		
		Попытка
			ТочкаОбъект.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("en='Recorded point ""';ru='Записана точка ""'")+СокрЛП(ТочкаКБП)+""".");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры
